УТ_для_edt/src/Catalogs/смартДЛ_Терминалы/смартДЛ_Терминалы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>смартДЛ_Терминалы</name>
  <attributes>
    <name>ИДтерминала</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <type>
      <types>CatalogRef.смартДЛ_Города</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолныйАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>600</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Широта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Долгота</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоОфис</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Приемка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Выдача</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Хранение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаНаложенымПлатежом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодУлицы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикПоПриему</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикПоВыдаче</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйОбъем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальнаяДлина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальнаяШирина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальнаяВысота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>РежимРаботыОтделов</name>
    <attributes>
      <name>Отдел</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РежимРаботы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/смартДЛ_Терминалы/ManagerModule.bsl
Функция ПолучитьМассивПоляПоиска() Экспорт	
	
	Возврат смартДеловыеЛинии.МассивДвухЭлементов("id", "ИДтерминала");
	
КонецФункции    

Функция ПолучитьТаблицуПолейЗначений() Экспорт
	
	Результат = смартДеловыеЛинии.НоваяТаблицаПолейЗначений();
	смартДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "name", "Наименование", "Реквизит");	 
	смартДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "address", "Адрес", "Реквизит");	 
	смартДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "fullAddress", "ПолныйАдрес", "Реквизит");	 
	смартДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "latitude", "Широта", "Реквизит");
	смартДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "longitude", "Долгота", "Реквизит");	 
	смартДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "isOffice", "ТолькоОфис", "Реквизит");	 
	смартДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "receiveCargo", "Приемка", "Реквизит");	 
	смартДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "giveoutCargo", "Выдача", "Реквизит");	 
	смартДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "storage", "Хранение", "Реквизит");	 
	смартДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "cashOnDelivery", "ОплатаНаложенымПлатежом", "Реквизит");	 
	смартДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "addressCode", "", "ВложенныеРеквизиты", Новый Структура("street_code", "КодУлицы"));	 
	смартДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "calcSchedule", "", "ВложенныеРеквизиты", Новый Структура("arrival, derival", "ГрафикПоВыдаче", "ГрафикПоПриему"));
	смартДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "default", "ПоУмолчанию", "Реквизит");
	смартДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "maxVolume", "МаксимальныйОбъем", "Реквизит");
	смартДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "maxWeight", "МаксимальныйВес", "Реквизит");
	смартДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "maxHeight", "МаксимальнаяВысота", "Реквизит"); 
	смартДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "maxWidth", "МаксимальнаяШирина", "Реквизит");
	смартДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "maxLength", "МаксимальнаяДлина", "Реквизит");   	
	
	МассивРежимРаботы = Новый Массив;
	МассивРежимРаботы.Добавить("ТабличнаяЧасть");
	МассивРежимРаботы.Добавить("РежимРаботыОтделов");
	МассивРежимРаботы.Добавить(Новый Структура("Отдел, РежимРаботы", "department", "timetable"));	
	
	смартДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "worktables", "", "ВложенныеРеквизиты", Новый Структура("worktable", МассивРежимРаботы));
		
	Возврат Результат;
	
КонецФункции
